In [1]:
import pandas as pd

In [2]:
#declear movie rating dataframe: ratinngs from 1 to 5 
df_movie_rating = pd.DataFrame(
{'movie 1': [5,4,3,3,2,1],
'movie 2': [4,5,2,3,4,2]},
index = ['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [3]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

2.data operation with functions

In [4]:
#declare a custom function
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [5]:
#Test the function
print(movie_grade(5))

A

In [6]:
#apply the function to the data frame
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

3. Data operation with statistical functions

In [7]:
#Create a DataFrame With two Test
df_test_scores = pd.DataFrame(
{
    'Test1' : [95,84,73,88,82,61],
    'Test2' : [74,85,82,73,77,79]},
    index=['Jack','Lewis','Patrick','Rich','Kelly','Paula']
)

In [8]:
#Apply the max function to find the maximum score
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [9]:
#Apply the mean function to find the average score
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [10]:
#Apply the std function to find the standard deviation for boyh the tests
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

4. Data Operation using Groupby

In [12]:
#Create a dataframe with first and last name as former preidents
df_president_name = pd.DataFrame({'first' :['George','Bill','Ronald','Jimmy','George'],
                                 'last': ['Bush','Clinton','Regan','Carter','Washington']})

In [13]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [14]:
#Group the DataFrmae with the firstname
grouped = df_president_name.groupby('first')

In [17]:
#Group the DataFrmae with the firstname
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

5. Data Operation using sorting

In [18]:
#Sort values by first name
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

5. Data Standerdization

In [26]:
#Create a function to resturn the standaradize value
def standardize_test(test):
    return(test- test.mean())/ test.std()

In [27]:
standardize_test(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [30]:
#Apply the function to the entire dataset
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_test)

In [31]:
#Standardized test data is applied for the entire DataFrame
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889